export type PlanType = 'ramadan-plan' | 'trader-basic' | 'trader-pro' | 'drop-basics' | 'drop-pro';

export const plans = {
  'ramadan-plan': {
    name: 'الباقة الرمضانية',
    price: 39000,
    oldPrice: 69000,
    description: 'باقة مؤقتة بمميزات إضافية خلال رمضان',
    features: [
      'متجر الكتروني بتصميم رمضاني',
      'عدد منتجات غير محدود',
      'عدد طلبات غير محدود',
      'ادارة الطلبات',
      'ادارة المخزون',
      'دعم تسويقي مكثف',
      'تفعيل كوبونات خصم',
      'ربط ميتا وتيك توك وسناب بكسل',
      'الربط مع شركات التوصيل',
      'ثيمات متجر عدد 2',
      'صلاحية ادارة المتجر لـ 3 اشخاص',
      'اولوية الدعم 24/7',
    ],
  },

  'trader-basic': {
    name: 'الباقة الاساسية - للتجار',
    price: 39000,
    description: 'مثالية للبدء والتجربة',
    features: [
      'متجر إلكتروني',
      'عدد منتجات غير محدود',
      'عدد طلبات غير محدود',
      'ادارة الطلبات',
      'ادارة المخزون',
      'تحقق من هاتف العميل',
      'ثيمات متجر عدد 1',
      'محتوى خاص بمتجرك (رسوم إضافية)',
      'ربط ميتا وتيك توك وسناب بكسل',
      'صلاحية إدارة المتجر لشخص واحد',
    ],
  },

  'trader-pro': {
    name: 'الباقة الاحترافية - للتجار',
    price: 69000,
    description: 'للمتاجر الناشئة والكبيرة',
    features: [
      'متجر إلكتروني احترافي',
      'عدد منتجات غير محدود',
      'عدد طلبات غير محدود',
      'ادارة الطلبات',
      'ادارة المخزون',

      'دعم تسويقي',

      'تفعيل كوبونات خصم',
      'ربط ميتا وتيك توك وسناب بكسل',
      'الربط مع شركات التوصيل',
      'ثيمات متحر عدد 2 ',
      'صلاحية ادارة المتجر لـ 3 اشخاص',
      'اولوية الدعم 24/7',
    ],
  },

  'drop-basics': {
    name: 'الاساسية - للدروب شيبر',
    price: 39000,
    description: 'للدروب شيبر المبتدئ',
    features: [
      'متجر إلكتروني عدد 1',
      'منتجات جاهزة للرفع عدد 5',
      'محتوى جاهز للمنتجات',
      'حد الطلبات 125 شهرياً',

      'الربط مع شركات التوصيل',
      'ثيمات متجر عدد 1',

      'صلاحية إدارة المتجر لشخص واحد',
    ],
  },

  'drop-pro': {
    name: 'الاحترافية - للدروب شيبر',
    price: 69000,
    description: 'للمحترفين',
    features: [
      'متجر إلكتروني عدد 2',
      'عدد منتجات غير محدود',
      'عدد طلبات غير محدود',

      'خصومات ومكافآت',
      'ربط ميتا وتيك توك وسناب بكسل',
      'الربط مع شركات التوصيل',
      'ثيمات متجر عدد 2',
      'صلاحية إدارة المتجر 3 أشخاص',
      'أولوية الدعم 24/7',
    ],
  },
};
